Revit 2027 API
ParameterTypeId.IfcApplicationName Property
 "IfcApplicationName"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId IfcApplicationName { get; }
Public Shared ReadOnly Property IfcApplicationName As ForgeTypeId
	Get
public:
static property ForgeTypeId^ IfcApplicationName {
	ForgeTypeId^ get ();
}
static member IfcApplicationName : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace